Documents/ОтчетПоНалогуНаИмущество.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ОтчетПоНалогуНаИмущество</Name>
			<Posting>Deny</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Недвижимость</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаИмущества</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыИмущества</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоМесяцев</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ставка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНалога</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОценочнаяСтоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокЭксплуатации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбщаяПлощадь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кр</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кз</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ко</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьНУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МатериалСтен</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыМатериаловСтен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗемНалог</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтЛет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоЛет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЖилаяПлощадь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НежилаяПлощадь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыЗданийИСооружений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Транспорт</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаИмущества</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыИмущества</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АБВ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоМесяцев</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъемДвигателя</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидТранспорта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыТранспортаПоНалогуНаИмущество</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ставка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНалога</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтЛет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоЛет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ОтчетПоНалогуНаИмущество/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСлужебные

// Получает набор данных с сервера для процедуры ДатаПриИзменении.
//
&НаСервере
Функция ПолучитьДанныеДатаПриИзменении(ДатаПередИзменением)
	РазностьДат = БухгалтерскийУчетСервер.ПроверитьНомерДокумента(Объект.Ссылка, Объект.Дата, ДатаПередИзменением);
	
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("РазностьДат",	РазностьДат);
	
	Возврат СтруктураДанные;
КонецФункции // ПолучитьДанныеДатаПриИзменении()

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

&НаСервере
Функция ЕстьДокументВУказанныйПериод(Дата)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтчетПоНалогуНаИмущество.Ссылка
		|ИЗ
		|	Документ.ОтчетПоНалогуНаИмущество КАК ОтчетПоНалогуНаИмущество
		|ГДЕ
		|	НЕ ОтчетПоНалогуНаИмущество.ПометкаУдаления
		|	И КОНЕЦПЕРИОДА(ОтчетПоНалогуНаИмущество.Дата, ГОД) = &Дата";
	
	Запрос.УстановитьПараметр("Дата", Дата);		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат Выборка.Количество() > 0 	

КонецФункции 

&НаСервере
Процедура ЗаполнитьНаСервере()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СведенияПоНалогуНаИмущество.Активность,
		|	СведенияПоНалогуНаИмущество.Организация,
		|	СведенияПоНалогуНаИмущество.ОсновноеСредство,
		|	СведенияПоНалогуНаИмущество.Год,
		|	СведенияПоНалогуНаИмущество.ГруппаИмущества,
		|	СведенияПоНалогуНаИмущество.ДатаВводаВЭксплуатацию,
		|	СведенияПоНалогуНаИмущество.ЖилаяПлощадь,
		|	СведенияПоНалогуНаИмущество.НежилаяПлощадь,
		|	СведенияПоНалогуНаИмущество.КодИмущества,
		|	СведенияПоНалогуНаИмущество.КатегорияОбъектаИмущества,
		|	СведенияПоНалогуНаИмущество.КодНазначенияИмущества,
		|	СведенияПоНалогуНаИмущество.КодПользователяИмущества,
		|	СведенияПоНалогуНаИмущество.КоличествоМесяцев,
		|	СведенияПоНалогуНаИмущество.СуммаНалога,
		|	СведенияПоНалогуНаИмущество.ОценочнаяСтоимость,
		|	СведенияПоНалогуНаИмущество.ОбщаяПлощадь,
		|	СведенияПоНалогуНаИмущество.СтоимостьНУ,
		|	СведенияПоНалогуНаИмущество.МатериалСтен,
		|	СведенияПоНалогуНаИмущество.ЗемНалог,
		|	СведенияПоНалогуНаИмущество.Ставка,
		|	СведенияПоНалогуНаИмущество.Кр,
		|	СведенияПоНалогуНаИмущество.Кз,
		|	СведенияПоНалогуНаИмущество.Ко,
		|	СведенияПоНалогуНаИмущество.АБВ,
		|	СведенияПоНалогуНаИмущество.ОбъемДвигателя,
		|	СведенияПоНалогуНаИмущество.ВидТранспорта,
		|	СведенияПоНалогуНаИмущество.ОтЛет,
		|	СведенияПоНалогуНаИмущество.ДоЛет
		|ПОМЕСТИТЬ ВременнаяТаблицаЗаГод
		|ИЗ
		|	РегистрСведений.СведенияПоНалогуНаИмущество КАК СведенияПоНалогуНаИмущество
		|ГДЕ
		|	СведенияПоНалогуНаИмущество.Год = &Год
		|	И СведенияПоНалогуНаИмущество.Организация = &Организация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаЗаГод.Организация КАК Организация,
		|	ВременнаяТаблицаЗаГод.ОсновноеСредство КАК ОсновноеСредство,
		|	ВременнаяТаблицаЗаГод.Год КАК Год,
		|	ВременнаяТаблицаЗаГод.ГруппаИмущества КАК ГруппаИмущества,
		|	ВременнаяТаблицаЗаГод.ДатаВводаВЭксплуатацию КАК ДатаВводаВЭксплуатацию,
		|	ВременнаяТаблицаЗаГод.ЖилаяПлощадь КАК ЖилаяПлощадь,
		|	ВременнаяТаблицаЗаГод.НежилаяПлощадь КАК НежилаяПлощадь,
		|	ВременнаяТаблицаЗаГод.КодИмущества КАК КодИмущества,
		|	ВременнаяТаблицаЗаГод.КатегорияОбъектаИмущества КАК КатегорияОбъектаИмущества,
		|	ВременнаяТаблицаЗаГод.КодНазначенияИмущества КАК КодНазначенияИмущества,
		|	ВременнаяТаблицаЗаГод.КодПользователяИмущества КАК КодПользователяИмущества,
		|	ВременнаяТаблицаЗаГод.КоличествоМесяцев КАК КоличествоМесяцев,
		|	ВременнаяТаблицаЗаГод.СуммаНалога КАК СуммаНалога,
		|	ВременнаяТаблицаЗаГод.ОценочнаяСтоимость КАК ОценочнаяСтоимость,
		|	ВременнаяТаблицаЗаГод.ОбщаяПлощадь КАК ОбщаяПлощадь,
		|	ВременнаяТаблицаЗаГод.СтоимостьНУ КАК СтоимостьНУ,
		|	ВременнаяТаблицаЗаГод.МатериалСтен КАК МатериалСтен,
		|	ВременнаяТаблицаЗаГод.ЗемНалог КАК ЗемНалог,
		|	ВременнаяТаблицаЗаГод.Ставка КАК Ставка,
		|	ВременнаяТаблицаЗаГод.Кр КАК Кр,
		|	ВременнаяТаблицаЗаГод.Кз КАК Кз,
		|	ВременнаяТаблицаЗаГод.Ко КАК Ко,
		|	ВременнаяТаблицаЗаГод.ОтЛет,
		|	ВременнаяТаблицаЗаГод.ДоЛет
		|ИЗ
		|	ВременнаяТаблицаЗаГод КАК ВременнаяТаблицаЗаГод
		|ГДЕ
		|	ВременнаяТаблицаЗаГод.ГруппаИмущества = ЗНАЧЕНИЕ(Справочник.ГруппыИмущества.ГИ2)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВременнаяТаблицаЗаГод.Организация,
		|	ВременнаяТаблицаЗаГод.ОсновноеСредство,
		|	ВременнаяТаблицаЗаГод.Год,
		|	ВременнаяТаблицаЗаГод.ГруппаИмущества,
		|	ВременнаяТаблицаЗаГод.ДатаВводаВЭксплуатацию,
		|	ВременнаяТаблицаЗаГод.ЖилаяПлощадь,
		|	ВременнаяТаблицаЗаГод.НежилаяПлощадь,
		|	ВременнаяТаблицаЗаГод.КодИмущества,
		|	ВременнаяТаблицаЗаГод.КатегорияОбъектаИмущества,
		|	ВременнаяТаблицаЗаГод.КодНазначенияИмущества,
		|	ВременнаяТаблицаЗаГод.КодПользователяИмущества,
		|	ВременнаяТаблицаЗаГод.КоличествоМесяцев,
		|	ВременнаяТаблицаЗаГод.СуммаНалога,
		|	ВременнаяТаблицаЗаГод.ОценочнаяСтоимость,
		|	ВременнаяТаблицаЗаГод.ОбщаяПлощадь,
		|	ВременнаяТаблицаЗаГод.СтоимостьНУ,
		|	ВременнаяТаблицаЗаГод.МатериалСтен,
		|	ВременнаяТаблицаЗаГод.ЗемНалог,
		|	ВременнаяТаблицаЗаГод.Ставка,
		|	ВременнаяТаблицаЗаГод.Кр,
		|	ВременнаяТаблицаЗаГод.Кз,
		|	ВременнаяТаблицаЗаГод.Ко,
		|	NULL,
		|	NULL
		|ИЗ
		|	ВременнаяТаблицаЗаГод КАК ВременнаяТаблицаЗаГод
		|ГДЕ
		|	ВременнаяТаблицаЗаГод.ГруппаИмущества = ЗНАЧЕНИЕ(Справочник.ГруппыИмущества.ГИ3)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОсновноеСредство
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблицаЗаГод.ОсновноеСредство КАК ОсновноеСредство,
		|	ВременнаяТаблицаЗаГод.ГруппаИмущества,
		|	ВременнаяТаблицаЗаГод.ДатаВводаВЭксплуатацию,
		|	ВременнаяТаблицаЗаГод.КоличествоМесяцев,
		|	ВременнаяТаблицаЗаГод.СуммаНалога,
		|	ВременнаяТаблицаЗаГод.Ставка,
		|	ВременнаяТаблицаЗаГод.АБВ,
		|	ВременнаяТаблицаЗаГод.ОбъемДвигателя,
		|	ВременнаяТаблицаЗаГод.ВидТранспорта,
		|	ВременнаяТаблицаЗаГод.ОтЛет,
		|	ВременнаяТаблицаЗаГод.ДоЛет
		|ИЗ
		|	ВременнаяТаблицаЗаГод КАК ВременнаяТаблицаЗаГод
		|ГДЕ
		|	ВременнаяТаблицаЗаГод.ГруппаИмущества = ЗНАЧЕНИЕ(Справочник.ГруппыИмущества.ГИ4)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ОсновноеСредство";
	
	Запрос.УстановитьПараметр("Год", 			ДатаДокумента);
	Запрос.УстановитьПараметр("Организация", 	Объект.Организация);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Объект.Недвижимость.Загрузить(РезультатЗапроса[1].Выгрузить());
	Объект.Транспорт.Загрузить(РезультатЗапроса[2].Выгрузить());	

КонецПроцедуры // ЗаполнитьНаСервере()

#КонецОбласти

#Область ОбработчикиСобытийФормы

// Процедура - обработчик события ПриСозданииНаСервере.
// В процедуре осуществляется
// - инициализация реквизитов формы,
// - установка параметров функциональных опций формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Установка реквизитов формы.
	ДатаДокумента = Объект.Дата;
	Если НЕ ЗначениеЗаполнено(ДатаДокумента) Тогда
		ДатаДокумента = КонецГода(ТекущаяДата());
	КонецЕсли;
	
	// СтандартныеПодсисте.Печать
	УправлениеПечатью.ПриСозданииНаСервере(ЭтаФорма, Элементы.ГруппаВажныеКоманды);
	// Конец СтандартныеПодсистемы.Печать
КонецПроцедуры

// Процедура - обработчик события ПриЧтенииНаСервере.
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменений
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменений
	
КонецПроцедуры // ПриЧтенииНаСервере()

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
		
	Если Объект.Недвижимость.Количество() > 0 ИЛИ Объект.Недвижимость.Количество() > 0 Тогда 
		ОписаниеОповещения = Новый ОписаниеОповещения("ОтветНаВопросЗаполнить", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Данные табличной части документа будут перезаполнены! Продолжить выполнение операции?'");
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 60);
	Иначе
		ЗаполнитьНаСервере();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиРезультатовИнтерактивныхДействий

&НаКлиенте
Процедура ОтветНаВопросЗаполнить(РезультатВопроса, ДополнительныеПараметры) Экспорт
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗаполнитьНаСервере();
	КонецЕсли; 
КонецПроцедуры	

#КонецОбласти

#Область ОбработчикиРеквизитовШапки

// Процедура - обработчик события ПриИзменении поля ввода Дата.
// В процедуре определяется ситуация, когда при изменении своей даты документ 
// оказывается в другом периоде нумерации документов, и в этом случае
// присваивает документу новый уникальный номер.
// Переопределяет соответствующий параметр формы.
//
&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Объект.Дата = КонецГода(Объект.Дата);
	Если ЕстьДокументВУказанныйПериод(Объект.Дата) Тогда
		ТекстСообщения = НСтр("ru = 'Для указанного периода уже существует документ Отчет налог на имущество!'");
		БухгалтерскийУчетСервер.СообщитьОбОшибке(
			Объект.Ссылка,   
			ТекстСообщения,
			,
			,
			"Объект.Дата",
			Истина);
				
		Объект.Дата	= ДатаДокумента;
	    Возврат;
	КонецЕсли;

	// Обработка события изменения даты.
	ДатаПередИзменением = ДатаДокумента;
	ДатаДокумента = Объект.Дата;
	Если Объект.Дата <> ДатаПередИзменением Тогда		
		Объект.Дата = КонецМесяца(Объект.Дата);		
		СтруктураДанные = ПолучитьДанныеДатаПриИзменении(ДатаПередИзменением);
		Если СтруктураДанные.РазностьДат <> 0 Тогда
			Объект.Номер = "";
		КонецЕсли;				
	КонецЕсли;

КонецПроцедуры

// Процедура - обработчик события ПриИзменении поля ввода Организация.
//
&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	// Обработка события изменения организации.
	Объект.Номер = "";
	БухгалтерскийУчетСервер.ПроверитьСуществованиеУчетнойПолитикиОрганизаций(ДатаДокумента, Объект.Организация);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиБиблиотек
// СтандартныеПодсистемы.Печать
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Печать
#КонецОбласти
